<?php
/**
 * Created by PhpStorm.
 * User: Aui
 * Date: 14/7/2559
 * Time: 0:49
 */

$lang = [
    /**
     * Navigation bar menu
     */
    'nav' => [
        'viewcart' => 'ตะกร้าสินค้า',
        'checkout' => 'เช็คเอาท์'
    ],

    /**
     * Offensive canvas menu
     */
    'canvas' => [
        'home'          => 'หน้าหลัก',
        'pass'          => 'วีไอพี พาส',
        'bookaparty'    => 'จองปาร์ตี้',
        'buyticket'     => 'จองคลาส',
        'signawaiver'   => 'กรอกใบยินยอม',
    ],

    /**
     * View cart & Checkout box
     */
    'viewcartCheckoutBox' => [
        'title' => 'ตะกร้าของคุณ',
        'item'  => 'รายการ',
        'total' => 'รวมเงิน'
    ],

    /**
     * button text
     */
    'button' => [
        'save' => 'บันทึก',
        'cancel' => 'ยกเลิก',
        'addToCart' => 'เพิ่มไปยังตะกร้า',
        'keepShopping' => 'ช็อปปิ้งต่อ',
        'update' => 'แก้ไข',
        'continue' => 'ดำเนินการต่อ',
        'close' => 'ปิด'
    ],

    /**
     * label text
     */
    'label' => [
        'fullName' => 'ชื่อ - นามสกุล',
        'firstname' => 'ชื่อ',
        'lastname' => 'นามสกุล',
        'telephone' => 'เบอร์โทรศัพท์',
        'email' => 'อีเมล์',
        'mycart' => 'ตะกร้าของฉัน',
        'quantity' => 'จำนวน',
        'price' => 'ราคา',
        'minute' => 'นาที',
        'description' => 'รายการ',
        'amount' => 'จำนวนเงิน',
        'subtotal' => 'รวมเงิน',
        'saleTax' => 'ภาษีมูลค่าเพิ่ม',
        'orderTotal' => 'จำนวนเงินสุทธิ',
        'enterContractTitle' => 'กรอกข้อมูลสำหรับติดต่อ',
        'selectDate' => 'เลือกวันที่',
        'selectTime' => 'เลือกเวลา',
        'selectTimeOn' => 'เลือกเวลากระโดดในวันที่',
        'selectTicket' => 'เลือกทิคเก็ต',
        'ticketType' => 'ทิคเก็ต',
        'invoiceNo' => 'ใบชำระเงินเลขที่',
        'customerName' => 'ชื่อลูกค้า',
        'createAt' => 'วันที่ทำรายการ',
        'paymentMethod' => 'ช่องทางการจ่ายเงิน',
        'statusPayment' => 'สถานะการดำเนินการ'
    ],

    /**
     * messages
     */
    'msg' => [
        'notFound' => 'ไม่พบข้อมูล',
        'paymentDueDate' => 'กรุณาชำระเงินภายใน 7 วัน',
        'informMessage' => 'แสดง อีเมล์/ข้อความ ยืนยันการชำระเงินจากทาง Paysbuy.',
    ],

    /**
     * Pass page
     */
    'passPage' => [
        'description' => [
            'บัตร VIP Pass มีจำหน่ายแบบ 3 เดือน, 6 เดือน และ 12 เดือน เจ้าของบัตรสามารถเข้ากระโดดได้ไม่จำกัดเวลาทุกวัน ผู้ติดตามได้รับส่วนลด 20% สำหรับซื้อชั่วโมงกระโดดแบบปกติ (จำกัด 4 คนต่อวัน), เจ้าของบัตรจะได้รับส่วนลด 10% เมื่อซื้อร๊อคกิ้นคลาสต่างๆ, ส่วนลด 10% เมื่อซื้อผลิตภัณฑ์ของร๊อคกิ้นจั๊มพ์, ส่วนลด 5% เมื่อซื้ออาหารและเครื่องดื่มจากร๊อคกิ้นคาเฟ่',
            'ถุงเท้าร๊อคกิ้นไม่รวมในการซื้อ VIP Pass',
            'ผู้เล่นต้องเซ็นต์ใบยินยอมก่อนการเข้าเล่น',
            'รูปของเจ้าของบัตรจะถูกถ่ายและเก็บในระบบเพื่อยืนยันตัวตน',
            'บัตร VIP Pass สามารถใช้ได้เฉพาะเจ้าของที่มีชื่อบนบัตรเท่านั้น'
        ],
        'contentTitle' => [
            'passInfo' => 'รายละเอียดข้อมูล'
        ]
    ],

    /**
     * paysbuy
     */
    'paysbuy' => [
        'status' => [
            '00' => 'สำเร็จ',
            '02' => 'อยู่ระหว่างดำเนินการ',
            '99' => 'ไม่สำเร็จ',
        ],
        'approveCode' => 'รหัสอนุมัติจากเพย์สบาย',
        'amount' => 'ยอดการชำระเงินของรายการ',
        'fee' => 'ค่าธรรมเนียมการชำระเงิน',
        'method' => [
            '01' => 'บัญชีเพย์สบาย',
            '02' => 'บัตรเครดิต',
            '03' => 'บัญชีเพย์พาล',
            '04' => 'อเมริกัน เอ็กซ์เพรส',
            '05' => 'ออนไลน์ ไดเร็กเดบิต',
            '06' => 'เงินสด',
            '08' => 'สมาร์ทเพิร์ส',
            '09' => 'การผ่อนชำระ'
        ]
    ]
];